TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE    1

    5029              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                        Unix v4.4.1 *
       3              ;* Date/Time created: Tue Feb 18 12:16:36 2025                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5549  ; code avoids SE CPU_28
      16                      .noremark 5558  ; code avoids SE CPU_33
      17                      .noremark 5570  ; code avoids SE CPU_40
      18                      .noremark 5571  ; code avoids SE CPU_41

    4020 000f7c 7C00          SUB #1, T0, AR1 ; |150| 
         000f7e 0194 
    4021 000f80 2290          MOV AR1, AC0
    4022 000f82 1045          SFTS AC0, #4, AC1 ; |150| 
         000f84 04   
    4023 000f85 1043          ADD AC0 << #5, AC1 ; |150| 
         000f87 05   
    4024 000f88 7A00          MOV #(_tcb_table >> 16) << #16, AC0 ; |150| 
         000f8a 000A%
    4025 000f8c 7E00          OR #(_tcb_table & 0xffff), AC0, AC0 ; |150| 
         000f8e 0000%
    4026 000f90 2410          ADD AC1, AC0 ; |150| 
    4027 000f92 9008          MOV AC0, XAR0
    4028 000f94       $C$L143:    
    4029 000f94 A90D          MOV *AR0(#24), AR1 ; |151| 
         000f96 0018 
    4030 000f9c 9E89          XCCPART AR1 == #0 ||
    4031 000f98 76FF             MOV #-42, T0 ; |152| 
         000f9a D648 
    4032 000f9e 0409          BCC $C$L147,AR1 == #0 ; |152| 
         000fa0 33   
    4033                                                      ; branchcc occurs ; |152| 
    4034 000fa1 7600          MOV #16, AR2 ; |153| 
         000fa3 10A8 
    4035              
    4036 000fa5 129C          CMPU AR1 != AR2, TC1 ; |153| 
         000fa7 A4   
    4037 000fa8 21    ||      NOP       ;                     avoids Silicon Exception CPU_24
    4038              
    4039 000fad 9EF4          XCCPART !TC1 ||
    4040 000fa9 76FF             MOV #-41, T0 ; |154| 
         000fab D748 
    4041 000faf 0474          BCC $C$L147,!TC1 ; |154| 
         000fb1 22   
    4042                                                      ; branchcc occurs ; |154| 
    4043 000fb2 A931          MOV *(#3), AR1 ; |156| 
         000fb4 0000 
         000fb6 03   
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE   92

    4044 000fb7 7D08          AND #0x0800, AR1, T2 ; |156| 
         000fb9 0069 
    4045 000fbb 46B3       BSET ST1_INTM
    4046 000fbd 6315          BCC $C$L144,T1 != #0 ; |157| 
    4047                                                      ; branchcc occurs ; |157| 
    4048 000fbf A40D          MOV *AR0(#21), T0 ; |158| 
         000fc1 0015 
    4049 000fc3 4A04          B $C$L145 ; |158| 
    4050                                                      ; branch occurs ; |158| 
    4051 000fc5       $C$L144:    
    4052 000fc5 7C00          SUB #1, T1, T0 ; |160| 
         000fc7 0145 
    4053              $C$L145:    
    4054              $C$DW$229       .dwtag  DW_TAG_TI_branch
    4055                      .dwattr $C$DW$229, DW_AT_low_pc(0x00)
    4056                      .dwattr $C$DW$229, DW_AT_name("_change_task_priority")
    4057                      .dwattr $C$DW$229, DW_AT_TI_call
    4058 000fc9 08FE          CALL #_change_task_priority ; |160| 
         000fcb 3E   
    4059                                                      ; call occurs [#_change_task_priority] ; |160| 
    4060 000fcc 6116          BCC $C$L146,T2 != #0 ; |162| 
    4061                                                      ; branchcc occurs ; |162| 
    4062 000fce 46B2       BCLR ST1_INTM
    4063 000fd0       $C$L146:    
    4064 000fd0 951F     INTR #31
    4065 000fd2 3C04          MOV #0, T0
    4066 000fd4       $C$L147:    
    4067 000fd4 5062          POP T2
    4068                      .dwpsn  file "/data/projects/crt/ittrium/sample/c55x/../../kernel/tsk_manage.c",line 167,column 1,is_
    4069              $C$DW$230       .dwtag  DW_TAG_TI_branch
    4070                      .dwattr $C$DW$230, DW_AT_low_pc(0x00)
    4071                      .dwattr $C$DW$230, DW_AT_TI_return
    4072 000fd6 4804          RET
    4073                                                      ; return occurs
    4074                      .dwattr $C$DW$226, DW_AT_TI_end_file("/data/projects/crt/ittrium/sample/c55x/../../kernel/tsk_manage.
    4075                      .dwattr $C$DW$226, DW_AT_TI_end_line(0xa7)
    4076                      .dwattr $C$DW$226, DW_AT_TI_end_column(0x01)
    4077                      .dwendtag $C$DW$226
    4078              
    4079              ;******************************************************************************
    4080              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    4081              ;******************************************************************************
    4082                      .global __install_handler
    4083                      .global _init_tsk
    4084                      .global _start_hw_timer
    4085                      .global _terminate_hw_timer
    4086                      .global _make_task_context
    4087                      .global _timer_hw_enter
    4088                      .global _timer_hw_exit
    4089                      .global _init_tsk_stack
    4090                      .global _init_tsk_sys_stack
    4091                      .global __system_ticks
    4092              
    4093              ;*******************************************************************************
    4094              ;* TYPE INFORMATION                                                            *
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE   93

    4095              ;*******************************************************************************
    4096              
    4097              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4098                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x06)
    4099              $C$DW$231       .dwtag  DW_TAG_member
    4100                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    4101                      .dwattr $C$DW$231, DW_AT_name("sp")
    4102                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_sp")
    4103                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4104                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4105              $C$DW$232       .dwtag  DW_TAG_member
    4106                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    4107                      .dwattr $C$DW$232, DW_AT_name("ssp")
    4108                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_ssp")
    4109                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4110                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4111              $C$DW$233       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    4113                      .dwattr $C$DW$233, DW_AT_name("reta")
    4114                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_reta")
    4115                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4116                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4117                      .dwendtag $C$DW$T$20
    4118              
    4119              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CTXB")
    4120                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$20)
    4121                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4122              
    4123              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4124                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    4125              $C$DW$234       .dwtag  DW_TAG_member
    4126                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$22)
    4127                      .dwattr $C$DW$234, DW_AT_name("waiptn")
    4128                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_waiptn")
    4129                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4130                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4131              $C$DW$235       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$23)
    4133                      .dwattr $C$DW$235, DW_AT_name("wfmode")
    4134                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_wfmode")
    4135                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4136                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4137              $C$DW$236       .dwtag  DW_TAG_member
    4138                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$24)
    4139                      .dwattr $C$DW$236, DW_AT_name("p_flgptn")
    4140                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_p_flgptn")
    4141                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4142                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4143                      .dwendtag $C$DW$T$25
    4144              
    4145              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("WINFO_FLG")
    4146                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$25)
    4147                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    4148              
    4149              $C$DW$T$29      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE   94

    4150                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    4151              $C$DW$237       .dwtag  DW_TAG_member
    4152                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$28)
    4153                      .dwattr $C$DW$237, DW_AT_name("ppk_msg")
    4154                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ppk_msg")
    4155                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4156                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4157                      .dwendtag $C$DW$T$29
    4158              
    4159              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("WINFO_MBX")
    4160                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$29)
    4161                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4162              
    4163              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4164                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    4165              $C$DW$238       .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$30)
    4167                      .dwattr $C$DW$238, DW_AT_name("st_low")
    4168                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_st_low")
    4169                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4170                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$239       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$30)
    4173                      .dwattr $C$DW$239, DW_AT_name("st_high")
    4174                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_st_high")
    4175                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4176                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4177                      .dwendtag $C$DW$T$31
    4178              
    4179              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SYSTIM")
    4180                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$31)
    4181                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4182              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    4183                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    4184                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    4185              
    4186              $C$DW$T$34      .dwtag  DW_TAG_union_type
    4187                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
    4188              $C$DW$240       .dwtag  DW_TAG_member
    4189                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$32)
    4190                      .dwattr $C$DW$240, DW_AT_name("flg")
    4191                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_flg")
    4192                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4193                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4194              $C$DW$241       .dwtag  DW_TAG_member
    4195                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$33)
    4196                      .dwattr $C$DW$241, DW_AT_name("mbx")
    4197                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_mbx")
    4198                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4199                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4200                      .dwendtag $C$DW$T$34
    4201              
    4202              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("WINFO")
    4203                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$34)
    4204                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE   95

    4205              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4206                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4207              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("VP")
    4208                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$3)
    4209                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4210              
    4211              $C$DW$T$58      .dwtag  DW_TAG_array_type
    4212                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$19)
    4213                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4214                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x02)
    4215              $C$DW$242       .dwtag  DW_TAG_subrange_type
    4216                      .dwattr $C$DW$242, DW_AT_upper_bound(0x00)
    4217                      .dwendtag $C$DW$T$58
    4218              
    4219              
    4220              $C$DW$T$53      .dwtag  DW_TAG_subroutine_type
    4221                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4222              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    4223                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    4224                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    4225              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("FP")
    4226                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4227                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4228              
    4229              $C$DW$T$70      .dwtag  DW_TAG_subroutine_type
    4230                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4231              $C$DW$243       .dwtag  DW_TAG_formal_parameter
    4232                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    4233                      .dwendtag $C$DW$T$70
    4234              
    4235              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    4236                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    4237                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    4238              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("FP_VP")
    4239                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    4240                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4241              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4242                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4243                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4244                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4245              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4246                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4247                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4248                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4249              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4250                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4251                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4252                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4253              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4254                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4255                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4256                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4257              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4258                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4259                      .dwattr $C$DW$T$8, DW_AT_name("short")
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE   96

    4260                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4261              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("ER")
    4262                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$8)
    4263                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4264              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    4265                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    4266                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    4267              $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("H")
    4268                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$8)
    4269                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    4270              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("TMO")
    4271                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    4272                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    4273              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("ID")
    4274                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$8)
    4275                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4276              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("PRI")
    4277                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$8)
    4278                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4279              
    4280              $C$DW$T$149     .dwtag  DW_TAG_array_type
    4281                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$8)
    4282                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    4283              $C$DW$244       .dwtag  DW_TAG_subrange_type
    4284                      .dwendtag $C$DW$T$149
    4285              
    4286              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4287                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4288                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4289                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4290              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("ATR")
    4291                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$9)
    4292                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4293              $C$DW$T$150     .dwtag  DW_TAG_typedef, DW_AT_name("BOOL")
    4294                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$9)
    4295                      .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    4296              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("MODE")
    4297                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$9)
    4298                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4299              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("SIZE")
    4300                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$9)
    4301                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    4302              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("STAT")
    4303                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$9)
    4304                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4305              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("UH")
    4306                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$9)
    4307                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    4308              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("INHNO")
    4309                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4310                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4311              $C$DW$T$10      .dwtag  DW_TAG_base_type
    4312                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4313                      .dwattr $C$DW$T$10, DW_AT_name("int")
    4314                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE   97

    4315              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("INT")
    4316                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$10)
    4317                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4318              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    4319                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$10)
    4320                      .dwattr $C$DW$T$51, DW_AT_address_class(0x17)
    4321              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("VP_INT")
    4322                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    4323                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4324              $C$DW$T$11      .dwtag  DW_TAG_base_type
    4325                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4326                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4327                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    4328              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("UINT")
    4329                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$11)
    4330                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    4331              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("FLGPTN")
    4332                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    4333                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4334              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    4335                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$22)
    4336                      .dwattr $C$DW$T$24, DW_AT_address_class(0x17)
    4337              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("RELTIM")
    4338                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$21)
    4339                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4340              
    4341              $C$DW$T$48      .dwtag  DW_TAG_array_type
    4342                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$21)
    4343                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4344                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    4345              $C$DW$245       .dwtag  DW_TAG_subrange_type
    4346                      .dwattr $C$DW$245, DW_AT_upper_bound(0x00)
    4347                      .dwendtag $C$DW$T$48
    4348              
    4349              $C$DW$T$12      .dwtag  DW_TAG_base_type
    4350                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4351                      .dwattr $C$DW$T$12, DW_AT_name("long")
    4352                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    4353              $C$DW$T$13      .dwtag  DW_TAG_base_type
    4354                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4355                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4356                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    4357              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("UW")
    4358                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$13)
    4359                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    4360              $C$DW$T$14      .dwtag  DW_TAG_base_type
    4361                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4362                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    4363                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    4364                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    4365                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    4366              $C$DW$T$15      .dwtag  DW_TAG_base_type
    4367                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4368                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4369                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE   98

    4370                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    4371                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    4372              $C$DW$T$16      .dwtag  DW_TAG_base_type
    4373                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4374                      .dwattr $C$DW$T$16, DW_AT_name("float")
    4375                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    4376              $C$DW$T$17      .dwtag  DW_TAG_base_type
    4377                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4378                      .dwattr $C$DW$T$17, DW_AT_name("double")
    4379                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    4380              $C$DW$T$18      .dwtag  DW_TAG_base_type
    4381                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4382                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    4383                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    4384              $C$DW$T$92      .dwtag  DW_TAG_base_type
    4385                      .dwattr $C$DW$T$92, DW_AT_encoding(DW_ATE_signed_char)
    4386                      .dwattr $C$DW$T$92, DW_AT_name("signed char")
    4387                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x01)
    4388              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("VB")
    4389                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$92)
    4390                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    4391              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    4392                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    4393                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    4394              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    4395                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    4396                      .dwattr $C$DW$T$94, DW_AT_address_class(0x17)
    4397              
    4398              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4399                      .dwattr $C$DW$T$36, DW_AT_name("eventflag_control_block")
    4400                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    4401              $C$DW$246       .dwtag  DW_TAG_member
    4402                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$35)
    4403                      .dwattr $C$DW$246, DW_AT_name("gcb")
    4404                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_gcb")
    4405                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4406                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4407              $C$DW$247       .dwtag  DW_TAG_member
    4408                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$22)
    4409                      .dwattr $C$DW$247, DW_AT_name("flgptn")
    4410                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_flgptn")
    4411                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4412                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4413                      .dwendtag $C$DW$T$36
    4414              
    4415              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("FLGCB")
    4416                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$36)
    4417                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4418              
    4419              $C$DW$T$185     .dwtag  DW_TAG_array_type
    4420                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$107)
    4421                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    4422                      .dwattr $C$DW$T$185, DW_AT_byte_size(0x0c)
    4423              $C$DW$248       .dwtag  DW_TAG_subrange_type
    4424                      .dwattr $C$DW$248, DW_AT_upper_bound(0x00)
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE   99

    4425                      .dwendtag $C$DW$T$185
    4426              
    4427              
    4428              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4429                      .dwattr $C$DW$T$41, DW_AT_name("generic_control_block")
    4430                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0a)
    4431              $C$DW$249       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$37)
    4433                      .dwattr $C$DW$249, DW_AT_name("wait_queue")
    4434                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_wait_queue")
    4435                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4436                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4437              $C$DW$250       .dwtag  DW_TAG_member
    4438                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$38)
    4439                      .dwattr $C$DW$250, DW_AT_name("objid")
    4440                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_objid")
    4441                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4442                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4443              $C$DW$251       .dwtag  DW_TAG_member
    4444                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    4445                      .dwattr $C$DW$251, DW_AT_name("exinf")
    4446                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_exinf")
    4447                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4448                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4449              $C$DW$252       .dwtag  DW_TAG_member
    4450                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$39)
    4451                      .dwattr $C$DW$252, DW_AT_name("objatr")
    4452                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_objatr")
    4453                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4454                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4455              $C$DW$253       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$40)
    4457                      .dwattr $C$DW$253, DW_AT_name("state")
    4458                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_state")
    4459                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4460                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4461                      .dwendtag $C$DW$T$41
    4462              
    4463              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("GCB")
    4464                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$41)
    4465                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4466              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    4467                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$35)
    4468                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
    4469              
    4470              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    4471                      .dwattr $C$DW$T$43, DW_AT_name("queue")
    4472                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    4473              $C$DW$254       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$42)
    4475                      .dwattr $C$DW$254, DW_AT_name("next")
    4476                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_next")
    4477                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4478                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4479              $C$DW$255       .dwtag  DW_TAG_member
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE  100

    4480                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$42)
    4481                      .dwattr $C$DW$255, DW_AT_name("prev")
    4482                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_prev")
    4483                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4484                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4485                      .dwendtag $C$DW$T$43
    4486              
    4487              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("QUEUE")
    4488                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$43)
    4489                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4490              
    4491              $C$DW$T$45      .dwtag  DW_TAG_array_type
    4492                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$37)
    4493                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4494                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x2c)
    4495              $C$DW$256       .dwtag  DW_TAG_subrange_type
    4496                      .dwattr $C$DW$256, DW_AT_upper_bound(0x0a)
    4497                      .dwendtag $C$DW$T$45
    4498              
    4499              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    4500                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$37)
    4501                      .dwattr $C$DW$T$96, DW_AT_address_class(0x17)
    4502              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    4503                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$43)
    4504                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    4505              
    4506              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4507                      .dwattr $C$DW$T$49, DW_AT_name("ready_queue")
    4508                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x32)
    4509              $C$DW$257       .dwtag  DW_TAG_member
    4510                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$44)
    4511                      .dwattr $C$DW$257, DW_AT_name("top_priority")
    4512                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_top_priority")
    4513                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4514                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4515              $C$DW$258       .dwtag  DW_TAG_member
    4516                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$45)
    4517                      .dwattr $C$DW$258, DW_AT_name("tskque")
    4518                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_tskque")
    4519                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4520                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4521              $C$DW$259       .dwtag  DW_TAG_member
    4522                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$47)
    4523                      .dwattr $C$DW$259, DW_AT_name("null")
    4524                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_null")
    4525                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4526                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4527              $C$DW$260       .dwtag  DW_TAG_member
    4528                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$48)
    4529                      .dwattr $C$DW$260, DW_AT_name("bitmap")
    4530                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_bitmap")
    4531                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4532                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4533                      .dwendtag $C$DW$T$49
    4534              
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE  101

    4535              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("RDYQUE")
    4536                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$49)
    4537                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    4538              
    4539              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4540                      .dwattr $C$DW$T$50, DW_AT_name("t_cflg")
    4541                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    4542              $C$DW$261       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$39)
    4544                      .dwattr $C$DW$261, DW_AT_name("flgatr")
    4545                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_flgatr")
    4546                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4547                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4548              $C$DW$262       .dwtag  DW_TAG_member
    4549                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$22)
    4550                      .dwattr $C$DW$262, DW_AT_name("iflgptn")
    4551                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_iflgptn")
    4552                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4553                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4554                      .dwendtag $C$DW$T$50
    4555              
    4556              $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("T_CFLG")
    4557                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$50)
    4558                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    4559              $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    4560                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    4561                      .dwattr $C$DW$T$129, DW_AT_address_class(0x17)
    4562              
    4563              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    4564                      .dwattr $C$DW$T$57, DW_AT_name("t_ctsk")
    4565                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x0c)
    4566              $C$DW$263       .dwtag  DW_TAG_member
    4567                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$39)
    4568                      .dwattr $C$DW$263, DW_AT_name("tskatr")
    4569                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_tskatr")
    4570                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4571                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4572              $C$DW$264       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$52)
    4574                      .dwattr $C$DW$264, DW_AT_name("exinf")
    4575                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_exinf")
    4576                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4577                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4578              $C$DW$265       .dwtag  DW_TAG_member
    4579                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$55)
    4580                      .dwattr $C$DW$265, DW_AT_name("task")
    4581                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_task")
    4582                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4583                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4584              $C$DW$266       .dwtag  DW_TAG_member
    4585                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$44)
    4586                      .dwattr $C$DW$266, DW_AT_name("itskpri")
    4587                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_itskpri")
    4588                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4589                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE  102

    4590              $C$DW$267       .dwtag  DW_TAG_member
    4591                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$56)
    4592                      .dwattr $C$DW$267, DW_AT_name("stksz")
    4593                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_stksz")
    4594                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4595                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4596              $C$DW$268       .dwtag  DW_TAG_member
    4597                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    4598                      .dwattr $C$DW$268, DW_AT_name("stk")
    4599                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_stk")
    4600                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4601                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4602              $C$DW$269       .dwtag  DW_TAG_member
    4603                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    4604                      .dwattr $C$DW$269, DW_AT_name("sstk")
    4605                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_sstk")
    4606                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4607                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4608                      .dwendtag $C$DW$T$57
    4609              
    4610              $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("T_CTSK")
    4611                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$57)
    4612                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    4613              $C$DW$T$141     .dwtag  DW_TAG_pointer_type
    4614                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$140)
    4615                      .dwattr $C$DW$T$141, DW_AT_address_class(0x17)
    4616              
    4617              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    4618                      .dwattr $C$DW$T$59, DW_AT_name("t_msg")
    4619                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    4620              $C$DW$270       .dwtag  DW_TAG_member
    4621                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$58)
    4622                      .dwattr $C$DW$270, DW_AT_name("msgque")
    4623                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_msgque")
    4624                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4625                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4626                      .dwendtag $C$DW$T$59
    4627              
    4628              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("T_MSG")
    4629                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$59)
    4630                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    4631              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    4632                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    4633                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
    4634              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    4635                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4636                      .dwattr $C$DW$T$28, DW_AT_address_class(0x17)
    4637              
    4638              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4639                      .dwattr $C$DW$T$60, DW_AT_name("t_rflg")
    4640                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
    4641              $C$DW$271       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$38)
    4643                      .dwattr $C$DW$271, DW_AT_name("wtskid")
    4644                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_wtskid")
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE  103

    4645                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4646                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4647              $C$DW$272       .dwtag  DW_TAG_member
    4648                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$22)
    4649                      .dwattr $C$DW$272, DW_AT_name("flgptn")
    4650                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_flgptn")
    4651                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4652                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4653                      .dwendtag $C$DW$T$60
    4654              
    4655              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("T_RFLG")
    4656                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$60)
    4657                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    4658              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    4659                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    4660                      .dwattr $C$DW$T$135, DW_AT_address_class(0x17)
    4661              
    4662              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    4663                      .dwattr $C$DW$T$68, DW_AT_name("task_control_block")
    4664                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x30)
    4665              $C$DW$273       .dwtag  DW_TAG_member
    4666                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$37)
    4667                      .dwattr $C$DW$273, DW_AT_name("tskque")
    4668                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_tskque")
    4669                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4670                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4671              $C$DW$274       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$61)
    4673                      .dwattr $C$DW$274, DW_AT_name("tskctxb")
    4674                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_tskctxb")
    4675                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4676                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4677              $C$DW$275       .dwtag  DW_TAG_member
    4678                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$55)
    4679                      .dwattr $C$DW$275, DW_AT_name("task")
    4680                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_task")
    4681                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4682                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4683              $C$DW$276       .dwtag  DW_TAG_member
    4684                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    4685                      .dwattr $C$DW$276, DW_AT_name("stk")
    4686                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_stk")
    4687                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4688                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4689              $C$DW$277       .dwtag  DW_TAG_member
    4690                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    4691                      .dwattr $C$DW$277, DW_AT_name("sstk")
    4692                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_sstk")
    4693                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4694                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4695              $C$DW$278       .dwtag  DW_TAG_member
    4696                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$56)
    4697                      .dwattr $C$DW$278, DW_AT_name("stksz")
    4698                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_stksz")
    4699                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE  104

    4700                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4701              $C$DW$279       .dwtag  DW_TAG_member
    4702                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$38)
    4703                      .dwattr $C$DW$279, DW_AT_name("tskid")
    4704                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_tskid")
    4705                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4706                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4707              $C$DW$280       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$52)
    4709                      .dwattr $C$DW$280, DW_AT_name("exinf")
    4710                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_exinf")
    4711                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4712                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4713              $C$DW$281       .dwtag  DW_TAG_member
    4714                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$39)
    4715                      .dwattr $C$DW$281, DW_AT_name("tskatr")
    4716                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_tskatr")
    4717                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4718                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4719              $C$DW$282       .dwtag  DW_TAG_member
    4720                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$44)
    4721                      .dwattr $C$DW$282, DW_AT_name("itskpri")
    4722                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_itskpri")
    4723                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4724                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4725              $C$DW$283       .dwtag  DW_TAG_member
    4726                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$44)
    4727                      .dwattr $C$DW$283, DW_AT_name("tskpri")
    4728                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_tskpri")
    4729                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4730                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4731              $C$DW$284       .dwtag  DW_TAG_member
    4732                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$62)
    4733                      .dwattr $C$DW$284, DW_AT_name("actcnt")
    4734                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_actcnt")
    4735                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4736                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4737              $C$DW$285       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$40)
    4739                      .dwattr $C$DW$285, DW_AT_name("state")
    4740                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_state")
    4741                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4742                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4743              $C$DW$286       .dwtag  DW_TAG_member
    4744                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$63)
    4745                      .dwattr $C$DW$286, DW_AT_name("wgcb")
    4746                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_wgcb")
    4747                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4748                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4749              $C$DW$287       .dwtag  DW_TAG_member
    4750                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$64)
    4751                      .dwattr $C$DW$287, DW_AT_name("winfo")
    4752                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_winfo")
    4753                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4754                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE  105

    4755              $C$DW$288       .dwtag  DW_TAG_member
    4756                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$65)
    4757                      .dwattr $C$DW$288, DW_AT_name("ercd")
    4758                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_ercd")
    4759                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4760                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4761              $C$DW$289       .dwtag  DW_TAG_member
    4762                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$62)
    4763                      .dwattr $C$DW$289, DW_AT_name("wupcnt")
    4764                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_wupcnt")
    4765                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4766                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4767              $C$DW$290       .dwtag  DW_TAG_member
    4768                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$62)
    4769                      .dwattr $C$DW$290, DW_AT_name("suscnt")
    4770                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_suscnt")
    4771                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4772                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4773              $C$DW$291       .dwtag  DW_TAG_member
    4774                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$66)
    4775                      .dwattr $C$DW$291, DW_AT_name("wercd")
    4776                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_wercd")
    4777                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4778                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4779              $C$DW$292       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$67)
    4781                      .dwattr $C$DW$292, DW_AT_name("wtmeb")
    4782                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_wtmeb")
    4783                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4784                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4785                      .dwendtag $C$DW$T$68
    4786              
    4787              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("TCB")
    4788                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$68)
    4789                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4790              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    4791                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4792                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    4793              
    4794              $C$DW$T$208     .dwtag  DW_TAG_array_type
    4795                      .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$46)
    4796                      .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    4797                      .dwattr $C$DW$T$208, DW_AT_byte_size(0x60)
    4798              $C$DW$293       .dwtag  DW_TAG_subrange_type
    4799                      .dwattr $C$DW$293, DW_AT_upper_bound(0x01)
    4800                      .dwendtag $C$DW$T$208
    4801              
    4802              
    4803              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4804                      .dwattr $C$DW$T$73, DW_AT_name("timer_event_block")
    4805                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x0a)
    4806              $C$DW$294       .dwtag  DW_TAG_member
    4807                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$37)
    4808                      .dwattr $C$DW$294, DW_AT_name("queue")
    4809                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_queue")
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE  106

    4810                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4811                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4812              $C$DW$295       .dwtag  DW_TAG_member
    4813                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$69)
    4814                      .dwattr $C$DW$295, DW_AT_name("count")
    4815                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_count")
    4816                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4817                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4818              $C$DW$296       .dwtag  DW_TAG_member
    4819                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$72)
    4820                      .dwattr $C$DW$296, DW_AT_name("callback")
    4821                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_callback")
    4822                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4823                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4824              $C$DW$297       .dwtag  DW_TAG_member
    4825                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    4826                      .dwattr $C$DW$297, DW_AT_name("arg")
    4827                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_arg")
    4828                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4829                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4830                      .dwendtag $C$DW$T$73
    4831              
    4832              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("TMEB")
    4833                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$73)
    4834                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4835              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    4836                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$67)
    4837                      .dwattr $C$DW$T$101, DW_AT_address_class(0x17)
    4838                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4839              
    4840              ;***************************************************************
    4841              ;* DWARF REGISTER MAP                                          *
    4842              ;***************************************************************
    4843              
    4844              $C$DW$298       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC0")
    4845                      .dwattr $C$DW$298, DW_AT_location[DW_OP_reg0]
    4846              $C$DW$299       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC0")
    4847                      .dwattr $C$DW$299, DW_AT_location[DW_OP_reg1]
    4848              $C$DW$300       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC0_G")
    4849                      .dwattr $C$DW$300, DW_AT_location[DW_OP_reg2]
    4850              $C$DW$301       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC1")
    4851                      .dwattr $C$DW$301, DW_AT_location[DW_OP_reg3]
    4852              $C$DW$302       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC1")
    4853                      .dwattr $C$DW$302, DW_AT_location[DW_OP_reg4]
    4854              $C$DW$303       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC1_G")
    4855                      .dwattr $C$DW$303, DW_AT_location[DW_OP_reg5]
    4856              $C$DW$304       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC2")
    4857                      .dwattr $C$DW$304, DW_AT_location[DW_OP_reg6]
    4858              $C$DW$305       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC2")
    4859                      .dwattr $C$DW$305, DW_AT_location[DW_OP_reg7]
    4860              $C$DW$306       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC2_G")
    4861                      .dwattr $C$DW$306, DW_AT_location[DW_OP_reg8]
    4862              $C$DW$307       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC3")
    4863                      .dwattr $C$DW$307, DW_AT_location[DW_OP_reg9]
    4864              $C$DW$308       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC3")
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/129924KNrf8                                                     PAGE  107

    4865                      .dwattr $C$DW$308, DW_AT_location[DW_OP_reg10]
    4866              $C$DW$309       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC3_G")
    4867                      .dwattr $C$DW$309, DW_AT_location[DW_OP_reg11]
    4868              $C$DW$310       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("T0")
    4869                      .dwattr $C$DW$310, DW_AT_location[DW_OP_reg12]
    4870              $C$DW$311       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("T1")
    4871                      .dwattr $C$DW$311, DW_AT_location[DW_OP_reg13]
    4872              $C$DW$312       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("T2")
    4873                      .dwattr $C$DW$312, DW_AT_location[DW_OP_reg14]
    4874              $C$DW$313       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("T3")
    4875                      .dwattr $C$DW$313, DW_AT_location[DW_OP_reg15]
