TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/13005S2KDNd                                                     PAGE    1

     932              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                        Unix v4.4.1 *
       3              ;* Date/Time created: Tue Feb 18 12:16:37 2025                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5549  ; code avoids SE CPU_28
      16                      .noremark 5558  ; code avoids SE CPU_33
      17                      .noremark 5570  ; code avoids SE CPU_40
      18                      .noremark 5571  ; code avoids SE CPU_41

TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/13005S2KDNd                                                     PAGE   13

     594              $C$DW$T$10      .dwtag  DW_TAG_base_type
     595                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     596                      .dwattr $C$DW$T$10, DW_AT_name("int")
     597                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     598              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
     599                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$10)
     600                      .dwattr $C$DW$T$23, DW_AT_address_class(0x17)
     601              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("VP_INT")
     602                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     603                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     604              $C$DW$T$11      .dwtag  DW_TAG_base_type
     605                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     606                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     607                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     608              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("UINT")
     609                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$11)
     610                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     611              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("FLGPTN")
     612                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     613                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     614              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
     615                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$21)
     616                      .dwattr $C$DW$T$52, DW_AT_address_class(0x17)
     617              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("RELTIM")
     618                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$20)
     619                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
     620              $C$DW$T$12      .dwtag  DW_TAG_base_type
     621                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     622                      .dwattr $C$DW$T$12, DW_AT_name("long")
     623                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     624              $C$DW$T$13      .dwtag  DW_TAG_base_type
     625                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     626                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     627                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     628              $C$DW$T$14      .dwtag  DW_TAG_base_type
     629                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     630                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     631                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     632                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     633                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     634              $C$DW$T$15      .dwtag  DW_TAG_base_type
     635                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     636                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     637                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     638                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     639                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     640              $C$DW$T$16      .dwtag  DW_TAG_base_type
     641                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     642                      .dwattr $C$DW$T$16, DW_AT_name("float")
     643                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     644              $C$DW$T$17      .dwtag  DW_TAG_base_type
     645                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     646                      .dwattr $C$DW$T$17, DW_AT_name("double")
     647                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     648              $C$DW$T$18      .dwtag  DW_TAG_base_type
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/13005S2KDNd                                                     PAGE   14

     649                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     650                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     651                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     652              $C$DW$T$58      .dwtag  DW_TAG_base_type
     653                      .dwattr $C$DW$T$58, DW_AT_encoding(DW_ATE_signed_char)
     654                      .dwattr $C$DW$T$58, DW_AT_name("signed char")
     655                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
     656              $C$DW$59        .dwtag  DW_TAG_TI_far_type
     657                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$58)
     658              $C$DW$T$59      .dwtag  DW_TAG_const_type
     659                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$59)
     660              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
     661                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
     662                      .dwattr $C$DW$T$60, DW_AT_address_class(0x17)
     663              
     664              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     665                      .dwattr $C$DW$T$22, DW_AT_name("t_cflg")
     666                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     667              $C$DW$60        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     669                      .dwattr $C$DW$60, DW_AT_name("flgatr")
     670                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_flgatr")
     671                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     672                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     673              $C$DW$61        .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     675                      .dwattr $C$DW$61, DW_AT_name("iflgptn")
     676                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_iflgptn")
     677                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     678                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     679                      .dwendtag $C$DW$T$22
     680              
     681              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("T_CFLG")
     682                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$22)
     683                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
     684              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
     685                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
     686                      .dwattr $C$DW$T$48, DW_AT_address_class(0x17)
     687              
     688              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     689                      .dwattr $C$DW$T$31, DW_AT_name("t_ctsk")
     690                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0c)
     691              $C$DW$62        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     693                      .dwattr $C$DW$62, DW_AT_name("tskatr")
     694                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_tskatr")
     695                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     696                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     697              $C$DW$63        .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$24)
     699                      .dwattr $C$DW$63, DW_AT_name("exinf")
     700                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_exinf")
     701                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     702                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     703              $C$DW$64        .dwtag  DW_TAG_member
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/13005S2KDNd                                                     PAGE   15

     704                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$27)
     705                      .dwattr $C$DW$64, DW_AT_name("task")
     706                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_task")
     707                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     708                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     709              $C$DW$65        .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$28)
     711                      .dwattr $C$DW$65, DW_AT_name("itskpri")
     712                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_itskpri")
     713                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     714                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     715              $C$DW$66        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$29)
     717                      .dwattr $C$DW$66, DW_AT_name("stksz")
     718                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_stksz")
     719                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     720                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     721              $C$DW$67        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$30)
     723                      .dwattr $C$DW$67, DW_AT_name("stk")
     724                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_stk")
     725                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     726                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     727              $C$DW$68        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$30)
     729                      .dwattr $C$DW$68, DW_AT_name("sstk")
     730                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_sstk")
     731                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     732                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     733                      .dwendtag $C$DW$T$31
     734              
     735              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("T_CTSK")
     736                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$31)
     737                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     738              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
     739                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
     740                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
     741                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
     742              
     743              ;***************************************************************
     744              ;* DWARF REGISTER MAP                                          *
     745              ;***************************************************************
     746              
     747              $C$DW$69        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC0")
     748                      .dwattr $C$DW$69, DW_AT_location[DW_OP_reg0]
     749              $C$DW$70        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC0")
     750                      .dwattr $C$DW$70, DW_AT_location[DW_OP_reg1]
     751              $C$DW$71        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC0_G")
     752                      .dwattr $C$DW$71, DW_AT_location[DW_OP_reg2]
     753              $C$DW$72        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC1")
     754                      .dwattr $C$DW$72, DW_AT_location[DW_OP_reg3]
     755              $C$DW$73        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC1")
     756                      .dwattr $C$DW$73, DW_AT_location[DW_OP_reg4]
     757              $C$DW$74        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC1_G")
     758                      .dwattr $C$DW$74, DW_AT_location[DW_OP_reg5]
TMS320C55x Assembler Unix v4.4.1 Tue Feb 18 12:16:37 2025

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
/tmp/13005S2KDNd                                                     PAGE   16

     759              $C$DW$75        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC2")
     760                      .dwattr $C$DW$75, DW_AT_location[DW_OP_reg6]
     761              $C$DW$76        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC2")
     762                      .dwattr $C$DW$76, DW_AT_location[DW_OP_reg7]
     763              $C$DW$77        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC2_G")
     764                      .dwattr $C$DW$77, DW_AT_location[DW_OP_reg8]
     765              $C$DW$78        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC3")
     766                      .dwattr $C$DW$78, DW_AT_location[DW_OP_reg9]
     767              $C$DW$79        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC3")
     768                      .dwattr $C$DW$79, DW_AT_location[DW_OP_reg10]
     769              $C$DW$80        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AC3_G")
     770                      .dwattr $C$DW$80, DW_AT_location[DW_OP_reg11]
     771              $C$DW$81        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("T0")
     772                      .dwattr $C$DW$81, DW_AT_location[DW_OP_reg12]
     773              $C$DW$82        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("T1")
     774                      .dwattr $C$DW$82, DW_AT_location[DW_OP_reg13]
     775              $C$DW$83        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("T2")
     776                      .dwattr $C$DW$83, DW_AT_location[DW_OP_reg14]
     777              $C$DW$84        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("T3")
     778                      .dwattr $C$DW$84, DW_AT_location[DW_OP_reg15]
     779              $C$DW$85        .dwtag  DW_TAG_TI_assign_register, DW_AT_name("AR0")
